{
  "name": "Claude Houle",
  "title": "Full-Stack Developer & Software Architect",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montreal, QC",
  "phone": "450.723.3075",
  "summary": "Software developer with 23+ years of experience across backend systems, mobile platforms, and web applications. Proven ability to architect and deliver production software spanning the full stack — from Spring Boot backends and Angular frontends to native iOS and Android clients — with a focus on quality, mentorship, and continuous improvement.",
  "accomplishments": [
    "Led a production iOS app serving 200,000+ DAU with 99.999% crash-free rate across a 450K-line Swift codebase",
    "Architected full-stack solutions at Spiria: CAE's pilot training platform (Spring/Angular/iOS) and Acosta's retail analytics platform (Node.js/BackboneJS)",
    "Led end-to-end development of a visionOS-native app — 1st Connected Worker Solution on the visionOS App Store, securing an Apple Vision Pro Dev Kit",
    "Integrated CI/CD pipeline improving build speeds by 50% and increasing deployments from 1/week to 4/day through full App Store automation",
    "Doubled test coverage (30% → 60%) over four years through disciplined, incremental growth alongside codebase modernization"
  ],
  "skills": [
    {
      "section": "Technical Expertise"
    },
    {
      "label": "Languages",
      "items": [
        "Java",
        "Swift",
        "Kotlin",
        "TypeScript",
        "SQL",
        "Python"
      ]
    },
    {
      "label": "Backend",
      "items": [
        "Spring Boot",
        "Hibernate",
        "Node.js",
        "PostgreSQL",
        "MySQL"
      ]
    },
    {
      "label": "Frontend",
      "items": [
        "Angular",
        "React",
        "SwiftUI",
        "UIKit"
      ]
    },
    {
      "label": "Mobile",
      "items": [
        "iOS SDK",
        "visionOS SDK",
        "Android SDK",
        "Combine"
      ]
    },
    {
      "label": "Architecture",
      "items": [
        "REST API Design",
        "MVVM",
        "SOLID",
        "Microservices",
        "Clean Architecture"
      ]
    },
    {
      "section": "DevOps & Tools"
    },
    {
      "label": "CI/CD",
      "items": [
        "GitHub Actions",
        "Fastlane",
        "Jenkins",
        "Docker",
        "Kubernetes"
      ]
    },
    {
      "label": "Testing",
      "items": [
        "JUnit",
        "Mockito",
        "XCTest",
        "Swift Testing",
        "Jest"
      ]
    },
    {
      "label": "Gen AI",
      "items": [
        "Claude integration (code & test acceleration)"
      ]
    },
    {
      "section": "Leadership & Methodologies"
    },
    {
      "label": "Methods",
      "items": [
        "Agile (Scrum/Kanban)",
        "TDD",
        "Continuous Integration"
      ]
    },
    {
      "label": "Spoken",
      "items": [
        "French and English (fully bilingual)"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Architect, Lead iOS & VisionOS",
      "dates": "2021 — Present",
      "description": "Technical leader for a connected worker platform serving 200,000+ DAU. Driving full-stack evolution across mobile clients and backend integrations while ensuring 99.999% stability.",
      "bullets": [
        "Operational Excellence: Major refactoring of 450K-line codebase — raised stability to 99.999% crash-free and doubled test coverage (30% to 60%)",
        "CI/CD Performance: Migrated pipeline to MacStadium, accelerating builds by 50% and enabling 4 daily releases (up from 1/week)",
        "Team Leadership: Recruited and trained a distributed team of 20 developers internationally — operational within 3 months",
        "AI Integration: Optimized workflows through adoption of generative AI tools (Claude, Warp), reducing development time by 10%"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead Mobile Developer",
      "dates": "2019 — 2021",
      "description": "Led technical delivery of mobile solutions for major clients in healthcare, media, and retail. Managed full development cycles for brands like Metro, Super C, and Le Devoir.",
      "bullets": [
        "Technical Standardization: Designed shared iOS framework for 15+ client projects — reduced code duplication and development effort by 50%",
        "Major Deliveries: Technical leadership for flagship applications (Metro & Moi, Biodome de Montreal, AbbVie) from design to deployment",
        "Automation: Implemented CI/CD pipelines (MacStadium) for the entire client portfolio, industrializing release processes",
        "Mentorship: Coached junior developers and led knowledge-sharing sessions to raise overall technical proficiency"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Software Architect, Senior Developer",
      "dates": "2013 — 2019",
      "description": "Solution architect for custom software engagements spanning backend, frontend, and mobile. Led technical discovery, architecture design, and delivery for enterprise clients.",
      "bullets": [
        "CAE PreStudy: Designed end-to-end architecture spanning Spring backend, Angular frontend, and native iOS for aviation pilot training",
        "Acosta SLTouch: Built hybrid mobile app and framework for retail analytics using BackboneJS/MarionetteJS and Node.js",
        "Skillable: Delivered Progressive Web App for micro-learning using Angular and TypeScript",
        "Solution Architecture: Translated business requirements into API contracts, data models, and integration strategies"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "Back-End Java Developer → iOS Developer",
      "dates": "2009 — 2013",
      "description": "Pioneer in urban mobility software (Bixi) within a team combining hardware and software. Built backend systems and mobile clients for city-wide deployments.",
      "bullets": [
        "Full-Stack Transition: Started on backend Java team for Solstice bike-sharing suite; transitioned to iOS bringing backend expertise",
        "International Deployment: Developed Spotcycle and Solstice apps, deployed successfully in London and New York City",
        "AR Innovation: Pioneered first-ever Augmented Reality bike-sharing finder combining live camera feed with Core Location data"
      ]
    },
    {
      "company": "Accovia",
      "title": "Back-End Java Developer",
      "dates": "2007 — 2009",
      "bullets": [
        "Platform Recovery: Architecture Team member on Ibiza Project — rebuilt travel platform with Java/Spring/Hibernate after critical client recovery"
      ]
    },
    {
      "company": "Compuware Montreal",
      "title": "Java Consultant (Morgan Stanley)",
      "dates": "2005 — 2007",
      "bullets": [
        "Mainframe Migration: Migrated legacy systems to Java services on Libra project; globally distributed team (NY, Budapest, Tokyo)"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Java Developer",
      "dates": "2003 — 2005",
      "bullets": [
        "Infrastructure Services: Built core services and reusable components on Software Infrastructure team for e-commerce products"
      ]
    }
  ]
}