{
  "name": "Claude Houle",
  "title": "Lead développeur iOS & Architecte mobile",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montréal, QC",
  "sections": {
    "profile": "Profil",
    "accomplishments": "Réalisations clés",
    "skills": "Compétences techniques",
    "experience": "Expérience professionnelle",
    "education": "Formation"
  },
  "education": {
    "degree": "Techniques de l'informatique",
    "school": "Cégep Édouard-Montpetit, Longueuil, QC",
    "dates": "Sept 2000 — Mai 2003",
    "description": "Diplôme d'études collégiales (DEC) de trois ans couvrant le C, C++, Java, SQL, Linux et l'informatique appliquée."
  },
  "summary": "Développeur iOS avec plus de 15 ans sur les plateformes Apple et plus de 21 ans d'expérience totale en développement logiciel. De la stabilisation d'une base de code Swift de 450 000 lignes à 99,999 % sans plantage au lancement dès le jour un sur l'App Store visionOS, je construis des produits mobiles qui livrent des gains mesurables en fiabilité, cadence de publication et adoption utilisateur.",
  "accomplishments": [
    "Stabilisé une base de code Swift de 450 000 lignes servant plus de 200 000 utilisateurs actifs quotidiens — porté le taux sans plantage à 99,999 % et la cadence de publication de 1/semaine à 4/jour",
    "Construit et livré une application native visionOS ; obtenu un Vision Pro Dev Kit pour Poka suite à une revue Apple — lancée comme la 1re solution pour travailleurs connectés sur l'App Store visionOS",
    "Automatisé les déploiements App Store de bout en bout, augmentant la cadence de publication de 1/semaine à 4/jour et la vitesse de compilation CI de 50 %",
    "Intégré 20 développeurs sri-lankais avec un programme de formation sur mesure — équipe productive en 3 mois",
    "Construit une bibliothèque de composants iOS partagée chez Appcom qui a standardisé les pratiques sur plus de 15 projets clients et accéléré les livraisons"
  ],
  "skills": [
    {
      "label": "Langages",
      "items": [
        "Swift",
        "Kotlin",
        "Java",
        "TypeScript",
        "SQL"
      ]
    },
    {
      "label": "Apple",
      "items": [
        "iOS SDK",
        "visionOS SDK",
        "SwiftUI",
        "UIKit",
        "Combine",
        "Core Data",
        "SwiftData",
        "Core Location",
        "AVFoundation"
      ]
    },
    {
      "label": "Tests",
      "items": [
        "XCTest",
        "XCUITest",
        "Swift Testing",
        "Snapshot Testing"
      ]
    },
    {
      "label": "DevOps",
      "items": [
        "Fastlane",
        "GitHub Actions",
        "Swift Package Manager",
        "TestFlight",
        "Sentry",
        "LaunchDarkly"
      ]
    },
    {
      "label": "Pratiques",
      "items": [
        "MVVM",
        "SOLID",
        "REST API Design",
        "Mobile UX Design",
        "Software Architecture",
        "Claude Code"
      ]
    },
    {
      "label": "Additionnel",
      "items": [
        "Objective-C",
        "RxSwift",
        "watchOS SDK",
        "macOS SDK",
        "Instruments"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Architecte, Lead iOS, Lead VisionOS",
      "dates": "Oct 2021 — Présent",
      "description": "Plateforme pour travailleurs connectés — plus de 200 000 utilisateurs actifs quotidiens, 450 000 lignes de Swift + 55 000 lignes legacy Obj-C, 99,999 % sans plantage.",
      "bullets": [
        "Construit et livré une application native visionOS ; présentée à Apple, obtenu un Vision Pro Dev Kit pour Poka, et lancé la 1re solution pour travailleurs connectés sur l'App Store visionOS",
        "Hérité d'une base de code fragile avec des plantages fréquents ; mis en place des pratiques de refactorisation et des processus qualité qui ont porté le taux sans plantage à 99,999 %",
        "Face à des mises en production lentes et manuelles ; construit un pipeline CI/CD sur MacStadium qui a amélioré la vitesse de compilation de 50 % et augmenté les déploiements de 1/semaine à 4/jour",
        "Confronté à une faible couverture de tests (30 %) ; mené une initiative de tests incrémentale parallèlement aux refactorisations vers SwiftUI, Combine et des architectures modernes, atteignant 60 % en quatre ans",
        "Besoin de faire croître l'équipe rapidement ; intégré 20 développeurs sri-lankais avec un programme de formation sur mesure, les rendant productifs en 3 mois",
        "Adopté des outils assistés par IA (Claude, Warp.dev) dans le flux de travail de l'équipe iOS, réduisant le temps de développement de 10 %"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead développeur mobile",
      "dates": "Nov 2019 — Oct 2021",
      "description": "Studio de développement mobile — direction de l'équipe iOS sur plus de 15 projets clients dans le commerce de détail, la santé, les médias et la mobilité.",
      "bullets": [
        "Constaté des efforts dupliqués sur plus de 15 projets clients ; conçu un framework iOS partagé de composants documentés et testés qui a standardisé les pratiques et accéléré les livraisons",
        "Dirigé l'équipe mobile à travers des cycles de vie complets pour Metro & Moi, Super C, FoodBasics, AbbVie, Le Devoir, Biodôme de Montréal, Christies, TaxiCoop et autres",
        "Responsable des pipelines CI/CD sur MacStadium ; automatisé les déploiements App Store et les processus de mise en production pour toutes les applications clients",
        "Mentoré les développeurs juniors par des sessions individuelles et organisé des lunch-and-learns pour favoriser l'apprentissage continu"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Développeur iOS sénior, Architecte",
      "dates": "Nov 2013 — Nov 2019",
      "description": "Agence de logiciels sur mesure — responsable de la création de l'architecture initiale et de son évolution selon les exigences clients.",
      "bullets": [
        "CAE PreStudy : pris le projet des exigences jusqu'à la livraison, construisant une application iOS native pour la formation des pilotes d'aviation de bout en bout",
        "Payfare (DiDi/Lyft) : développé les clients iOS et Android pour une plateforme de paiement anticipé servant les chauffeurs de l'économie à la demande",
        "BookJane : construit une application iOS pour la gestion de la main-d'œuvre en santé",
        "Acosta SLTouch, Skillable : livré des solutions hybrides et PWA sur l'ensemble de la pile pour l'analytique de vente au détail et le micro-apprentissage"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "Développeur iOS",
      "dates": "Oct 2009 — Oct 2013",
      "description": "Logiciels et matériel pour le vélo-partage — développement mobile pionnier pour la mobilité urbaine.",
      "bullets": [
        "Développé les applications iOS Spotcycle et Solstice pour le vélo-partage, supportant des déploiements à l'échelle de la ville à Londres et New York",
        "Pionnier du tout premier système de réalité augmentée pour trouver des vélos en libre-service en combinant le flux caméra en direct avec les données Core Location",
        "Résolu les problèmes de connectivité peu fiable à travers des villes entières — ingénierie mobile pionnière sous des contraintes réelles"
      ]
    },
    {
      "company": "Accovia",
      "title": "Développeur Java back-end",
      "dates": "Oct 2007 — Oct 2009",
      "bullets": [
        "Intégré l'équipe d'architecture du projet Ibiza après un redressement client critique ; contribué à reconstruire la plateforme de zéro avec Java, Spring et Hibernate, livrant dans les délais et le budget"
      ]
    },
    {
      "company": "Compuware Montréal",
      "title": "Consultant Java",
      "dates": "Oct 2005 — Oct 2007",
      "bullets": [
        "Affecté au projet Libra de Morgan Stanley pour migrer des systèmes mainframe legacy vers des services Java ; travaillé au sein d'une équipe distribuée à travers New York, Budapest, Tokyo et Vancouver"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Développeur Java",
      "dates": "Mai 2003 — Oct 2005",
      "bullets": [
        "Intégré l'équipe d'infrastructure logicielle ; construit des services de base et des composants réutilisables adoptés par plusieurs équipes de produits e-commerce"
      ]
    }
  ]
}