{
  "name": "Claude Houle",
  "title": "Développeur iOS sénior",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montréal, QC",
  "phone": "450.723.3075",
  "sections": {
    "profile": "Profil",
    "accomplishments": "Réalisations clés",
    "skills": "Compétences techniques",
    "experience": "Expérience professionnelle",
    "education": "Formation Académique"
  },
  "education": {
    "degree": "Technique de l'informatique",
    "school": "Collège Édouard-Montpetit, Longueuil",
    "dates": "2003",
    "description": "Diplôme d'études collégiales (DEC) de trois ans couvrant le C, C++, JavaScript, SQL, Linux et l'informatique appliquée.",
    "capstone": "Projet de fin d'études : Réalisation technique d'un site Internet (e-commerce) pour une entreprise."
  },
  "summary": "Ingénieur iOS sénior avec une expérience approfondie dans la création de produits mobiles fiables et évolutifs sur les plateformes Apple. Passionné par la qualité du code, l'automatisation CI/CD et les technologies émergentes comme visionOS, avec un accent marqué sur la stabilité, les tests et une architecture pragmatique.",
  "accomplishments": [
    "Stabilisé une base de code Swift de 450 000 lignes (200 000 DAU) : Atteint un taux de sessions sans incident de 99,999 % et accéléré la cadence de mise en production de 1/semaine à 4/jour.",
    "Conçu et livré une application native visionOS sélectionnée par Apple pour l'obtention d'un Vision Pro Dev Kit ; lancée en tant que 1re solution pour travailleurs connectés sur l'App Store visionOS.",
    "Automatisé les déploiements App Store de bout en bout : Augmentation de la cadence de mise en production de 1/semaine à 4/jour et accélération de la compilation CI de 50 %.",
    "Mentorat technique et revues de code pour 20 développeurs intégrés à l'international — équipe opérationnelle en 3 mois.",
    "Conçu une bibliothèque de composants iOS partagée, standardisant les pratiques et accélérant la livraison de plus de 15 projets clients."
  ],
  "skills": [
    {
      "section": "Expertise iOS & Apple"
    },
    {
      "label": "Langages",
      "items": [
        "Swift (expert)",
        "SwiftUI",
        "Combine",
        "Objective-C (legacy)"
      ]
    },
    {
      "label": "Frameworks",
      "items": [
        "visionOS",
        "ARKit",
        "Core Data",
        "Core Location",
        "MapKit",
        "AVFoundation"
      ]
    },
    {
      "label": "Architecture",
      "items": [
        "Modular Architecture",
        "MVVM",
        "Clean Architecture",
        "Design Patterns",
        "SOLID"
      ]
    },
    {
      "label": "Concurrence",
      "items": [
        "Swift Concurrency (Async/Await)",
        "GCD"
      ]
    },
    {
      "section": "Outillage & DevOps"
    },
    {
      "label": "CI/CD",
      "items": [
        "Fastlane",
        "GitHub Actions",
        "Xcode Cloud",
        "MacStadium",
        "Jenkins"
      ]
    },
    {
      "label": "Outils",
      "items": [
        "Xcode",
        "Instruments (Profiling)",
        "Firebase",
        "Sentry",
        "Git"
      ]
    },
    {
      "label": "IA Générative",
      "items": [
        "Claude (accélération code & tests)"
      ]
    },
    {
      "section": "Leadership & Méthodologies"
    },
    {
      "label": "Leadership",
      "items": [
        "Mentorat",
        "Code Review",
        "Standardisation de code"
      ]
    },
    {
      "label": "Méthodes",
      "items": [
        "Agile (Scrum/Kanban)",
        "TDD",
        "Intégration continue"
      ]
    },
    {
      "label": "Langues",
      "items": [
        "Français et Anglais (parfaitement bilingue)"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Lead développeur, iOS & VisionOS",
      "dates": "2021 — Présent",
      "description": "Développeur sénior d'une plateforme de référence pour travailleurs connectés servant quotidiennement plus de 200 000 utilisateurs actifs. Pilotage de l'évolution vers des architectures modernes (SwiftUI, Combine) et maintenance du legacy (Obj-C), tout en garantissant une stabilité critique de 99,999 %.",
      "bullets": [
        "Innovation visionOS : Encadrement complet du développement de la 1re solution industrielle sur l'App Store visionOS (obtention du Vision Pro Dev Kit après revue par Apple)",
        "Excellence opérationnelle : Refactorisation majeure ayant augmenté le taux de stabilité à 99,999 % et doublé la couverture de tests (de 30 % à 60 %)",
        "Performance CI/CD : Migration du pipeline sur MacStadium, accélérant la compilation de 50 % et permettant de passer de 1 à 4 mises en production quotidiennes",
        "Mentorat technique : Mentorat technique et revues de code pour une équipe distribuée de 20 développeurs à l'international — opérationnelle en 3 mois",
        "Intégration de l'IA : Optimisation des flux de travail via l'adoption d'outils d'IA générative (Claude, Warp), réduisant le temps de développement de 10 %"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead développeur mobile",
      "dates": "2019 — 2021",
      "description": "Responsable de la livraison de solutions mobiles pour des clients de grande envergure dans les secteurs de la santé, des médias et du commerce de détail. J'ai dirigé l'équipe technique à travers des cycles complets de développement logiciel pour des marques comme Metro, Super C et Le Devoir.",
      "bullets": [
        "Standardisation technique : Conception d'un framework iOS partagé, optimisant la livraison et la cohérence sur plus de 15 projets clients",
        "Livraisons d'envergure : Leadership technique des applications principales (Metro & Moi, Biodôme de Montréal, AbbVie) de la conception au déploiement",
        "Automatisation : Mise en place et gestion des pipelines CI/CD (MacStadium) pour l'ensemble du portfolio client, industrialisant les processus de mise en production",
        "Mentorat : Accompagnement de développeurs juniors et animation de sessions de partage de connaissances (lunch-and-learns) pour élever le niveau technique global"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Développeur iOS sénior",
      "dates": "2013 — 2019",
      "description": "Développeur sénior responsable de la conception et de l'évolution de solutions mobiles sur mesure pour des clients d'envergure. Pilotage de l'aspect technique de projets critiques, de la définition des exigences jusqu'à la mise en marché.",
      "bullets": [
        "CAE PreStudy : Architecture et développement de bout en bout d'une application native iOS destinée à la formation haute performance des pilotes d'aviation",
        "Payfare (DiDi/Lyft) : Développement des clients mobiles pour une plateforme de paiement en temps réel pour les acteurs des services de mobilité et de transport (économie collaborative)",
        "Solutions multiplateformes : Livraison d'applications variées (santé, analytique de détail, micro-apprentissage) utilisant des technologies natives et hybrides selon les besoins d'affaires"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "Développeur iOS",
      "dates": "2009 — 2013",
      "description": "Pionnier du développement mobile pour la mobilité urbaine (Bixi) au sein d'une équipe alliant logiciel et matériel. Travail sur des systèmes à grande échelle sous des contraintes réelles de connectivité urbaine.",
      "bullets": [
        "Déploiement international : Développement des applications Spotcycle et Solstice (vélo-partage), déployées avec succès à Londres et New York",
        "Innovation en Réalité Augmentée (AR) : Conception d'un des premiers systèmes de Réalité Augmentée pour la localisation de vélos en libre-service, combinant flux vidéo et données géospatiales (Core Location)",
        "Optimisation réseau : Résolution de défis complexes de synchronisation de données en mode hors-ligne ou connectivité limitée"
      ]
    },
    {
      "company": "Accovia",
      "title": "Développeur Java back-end sénior",
      "dates": "2007 — 2009",
      "bullets": [
        "Contribution au redressement et à la reconstruction complète de la plateforme Ibiza (Java, Spring, Hibernate) suite à des enjeux clients critiques"
      ]
    },
    {
      "company": "Compuware Montréal",
      "title": "Consultant Java (Morgan Stanley)",
      "dates": "2005 — 2007",
      "bullets": [
        "Migration de systèmes mainframe legacy vers des services Java au sein d'une équipe distribuée mondialement (New York, Budapest, Tokyo)"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Développeur Java",
      "dates": "2003 — 2005",
      "bullets": [
        "Développement de services d'infrastructure et de composants réutilisables pour des plateformes de commerce électronique"
      ]
    }
  ]
}