{
  "name": "Claude Houle",
  "title": "Lead iOS Developer & Mobile Architect",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montreal, QC",
  "phone": "450.723.3075",
  "summary": "iOS developer with 15+ years on Apple platforms and 23+ years total in software development. I specialize in building reliable, scalable mobile products — from architecting shared libraries to leading distributed teams. Passionate about code quality, CI/CD automation, and emerging technologies like visionOS, I turn technical visions into concrete, user-centered solutions.",
  "accomplishments": [
    "Stabilized a 450,000-line Swift codebase (200,000 DAU): Achieved 99.999% crash-free session rate and accelerated release cadence from 1/week to 4/day.",
    "Built and shipped a visionOS-native app selected by Apple for a Vision Pro Dev Kit; launched as the 1st Connected Worker Solution on the visionOS App Store.",
    "Automated App Store deployments end-to-end: Increased release cadence from 1/week to 4/day and accelerated CI build times by 50%.",
    "Fast-tracked onboarding of 20 developers internationally via custom training curriculum — team operational within 3 months.",
    "Designed a shared iOS component library, standardizing practices and accelerating delivery across 15+ client projects."
  ],
  "skills": [
    {
      "section": "iOS & Apple Expertise"
    },
    {
      "label": "Languages",
      "items": [
        "Swift (expert)",
        "SwiftUI",
        "Combine",
        "Objective-C (legacy)"
      ]
    },
    {
      "label": "Frameworks",
      "items": [
        "visionOS",
        "ARKit",
        "Core Data",
        "Core Location",
        "MapKit",
        "AVFoundation"
      ]
    },
    {
      "label": "Architecture",
      "items": [
        "Modular Architecture",
        "MVVM",
        "Clean Architecture",
        "Design Patterns",
        "SOLID"
      ]
    },
    {
      "label": "Concurrency",
      "items": [
        "Swift Concurrency (Async/Await)",
        "GCD"
      ]
    },
    {
      "section": "Tooling & DevOps"
    },
    {
      "label": "CI/CD",
      "items": [
        "Fastlane",
        "GitHub Actions",
        "Xcode Cloud",
        "MacStadium",
        "Jenkins"
      ]
    },
    {
      "label": "Tools",
      "items": [
        "Xcode",
        "Instruments (Profiling)",
        "Firebase",
        "Sentry",
        "Git"
      ]
    },
    {
      "label": "Gen AI",
      "items": [
        "Claude integration (code & test acceleration)"
      ]
    },
    {
      "section": "Leadership & Methodologies"
    },
    {
      "label": "Leadership",
      "items": [
        "Mentorship",
        "Code Review",
        "Code Standardization",
        "Technical Recruiting"
      ]
    },
    {
      "label": "Methods",
      "items": [
        "Agile (Scrum/Kanban)",
        "TDD",
        "Continuous Integration"
      ]
    },
    {
      "label": "Spoken",
      "items": [
        "French and English (fully bilingual)"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Architect, Lead iOS & VisionOS",
      "dates": "2021 — Present",
      "description": "Architect and technical leader for a leading connected worker platform serving 200,000+ daily active users. Driving evolution toward modern architectures (SwiftUI, Combine) while maintaining legacy systems (Obj-C), ensuring critical stability at 99.999%.",
      "bullets": [
        "visionOS Innovation: Led end-to-end development of the 1st industrial solution on the visionOS App Store (secured Vision Pro Dev Kit after Apple review)",
        "Operational Excellence: Major refactoring effort that raised stability to 99.999% crash-free and doubled test coverage (30% to 60%)",
        "CI/CD Performance: Migrated pipeline to MacStadium, accelerating builds by 50% and enabling 4 daily releases (up from 1/week)",
        "Team Leadership: Recruited and trained a distributed team of 20 developers internationally — operational within 3 months",
        "AI Integration: Optimized workflows through adoption of generative AI tools (Claude, Warp), reducing development time by 10%"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead Mobile Developer",
      "dates": "2019 — 2021",
      "description": "Responsible for delivering mobile solutions for major clients in healthcare, media, and retail. Led the technical team through complete software development cycles for brands like Metro, Super C, and Le Devoir.",
      "bullets": [
        "Technical Standardization: Designed a shared iOS framework, optimizing delivery and consistency across 15+ client projects",
        "Major Deliveries: Technical leadership for flagship applications (Metro & Moi, Biodome de Montreal, AbbVie) from design to deployment",
        "Automation: Implemented and managed CI/CD pipelines (MacStadium) for the entire client portfolio, industrializing release processes",
        "Mentorship: Coached junior developers and led knowledge-sharing sessions (lunch-and-learns) to raise overall technical proficiency"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Senior iOS Developer & Architect",
      "dates": "2013 — 2019",
      "description": "Architect responsible for designing and evolving custom mobile solutions for major clients. Led the technical aspects of critical projects from requirements definition through go-to-market.",
      "bullets": [
        "CAE PreStudy: End-to-end architecture and development of a native iOS application for high-performance aviation pilot training",
        "Payfare (DiDi/Lyft): Developed mobile clients for a real-time payment platform serving mobility and transportation players (gig economy)",
        "Cross-platform Solutions: Delivered diverse applications (healthcare, retail analytics, micro-learning) using native and hybrid technologies based on business needs"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "iOS Developer",
      "dates": "2009 — 2013",
      "description": "Pioneer in mobile development for urban mobility (Bixi) within a team combining software and hardware. Worked on large-scale systems under real-world urban connectivity constraints.",
      "bullets": [
        "International Deployment: Developed Spotcycle and Solstice apps (bike-sharing), successfully deployed in London and New York",
        "Augmented Reality Innovation: Designed one of the first AR systems for locating shared bikes, combining video feed with geospatial data (Core Location)",
        "Network Optimization: Solved complex data synchronization challenges in offline or limited connectivity environments"
      ]
    },
    {
      "company": "Accovia",
      "title": "Back-End Java Developer",
      "dates": "2007 — 2009",
      "bullets": [
        "Contributed to the recovery and complete rebuild of the Ibiza platform (Java, Spring, Hibernate) following critical client issues"
      ]
    },
    {
      "company": "Compuware Montreal",
      "title": "Java Consultant (Morgan Stanley)",
      "dates": "2005 — 2007",
      "bullets": [
        "Migrated legacy mainframe systems to Java services within a globally distributed team (New York, Budapest, Tokyo)"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Java Developer",
      "dates": "2003 — 2005",
      "bullets": [
        "Developed infrastructure services and reusable components for e-commerce platforms"
      ]
    }
  ]
}