{
  "name": "Claude Houle",
  "title": "Senior Java Developer & Backend Architect",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montreal, QC",
  "phone": "450.723.3075",
  "summary": "Backend developer with 23+ years of experience building enterprise Java systems, microservices architectures, and high-throughput data platforms. Deep expertise in Spring ecosystem, database optimization, and distributed systems. Proven track record delivering mission-critical backends for financial services, travel, and manufacturing — with a focus on reliability, scalability, and team leadership.",
  "accomplishments": [
    "Architected and delivered the Ibiza travel platform rebuild at Accovia — Java/Spring/Hibernate backend serving major travel operators, delivered on time after critical client recovery",
    "Built backend services for 8D Technologies' Solstice platform — Java system processing real-time events from Bixi bike-sharing kiosks deployed across cities worldwide",
    "Designed backend architecture for CAE's pilot training platform at Spiria — Spring Boot APIs, data modeling, and integration strategies supporting aviation compliance requirements",
    "Built core infrastructure services at Mediagrif adopted across multiple e-commerce product teams — reusable data access layers, service components, and API patterns"
  ],
  "skills": [
    {
      "section": "Backend Expertise"
    },
    {
      "label": "Languages",
      "items": [
        "Java (expert)",
        "Kotlin",
        "SQL",
        "TypeScript",
        "Python"
      ]
    },
    {
      "label": "Frameworks",
      "items": [
        "Spring Boot",
        "Spring Security",
        "Hibernate/JPA",
        "REST APIs",
        "Microservices"
      ]
    },
    {
      "label": "Data",
      "items": [
        "PostgreSQL",
        "MySQL",
        "Oracle",
        "DB2",
        "Redis",
        "ActiveMQ"
      ]
    },
    {
      "section": "Architecture & DevOps"
    },
    {
      "label": "Architecture",
      "items": [
        "Domain-Driven Design",
        "CQRS",
        "Event Sourcing",
        "API Design",
        "System Integration"
      ]
    },
    {
      "label": "CI/CD",
      "items": [
        "Docker",
        "Kubernetes",
        "Jenkins",
        "GitLab CI",
        "GitHub Actions"
      ]
    },
    {
      "label": "Testing",
      "items": [
        "JUnit",
        "Mockito",
        "Integration Testing",
        "TDD",
        "Contract Testing"
      ]
    },
    {
      "label": "Gen AI",
      "items": [
        "Claude integration (code & test acceleration)"
      ]
    },
    {
      "section": "Leadership & Methodologies"
    },
    {
      "label": "Leadership",
      "items": [
        "Mentorship",
        "Code Reviews",
        "Technical Documentation",
        "Onboarding"
      ]
    },
    {
      "label": "Methods",
      "items": [
        "Agile (Scrum/Kanban)",
        "TDD",
        "Continuous Integration"
      ]
    },
    {
      "label": "Spoken",
      "items": [
        "French and English (fully bilingual)"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Technical Architect",
      "dates": "2021 — Present",
      "description": "Technical architect for a connected worker platform serving 200,000+ DAU. Designed REST API contracts and data synchronization strategies bridging frontend and backend teams.",
      "bullets": [
        "API Architecture: Designed REST API contracts enabling seamless interoperability between mobile clients and backend microservices — adopted as the standard across frontend and backend teams",
        "Cross-Team Standards: Established shared engineering standards, code review practices, and API conventions across frontend and backend development teams",
        "Data Synchronization: Architected data sync strategies for offline-first mobile clients — ensuring consistency and reliability across distributed services",
        "Team Onboarding: Trained 20 developers with custom curriculum covering architecture patterns and best practices — operational within 3 months"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead Mobile Developer",
      "dates": "2019 — 2021",
      "description": "Led technical architecture and API integration across 15+ client projects in healthcare, media, and retail sectors.",
      "bullets": [
        "Component Libraries: Designed shared component libraries and architectural patterns adopted across multiple project teams",
        "API Integration: Led integration efforts with various backend systems — established patterns for error handling, caching, and offline support",
        "Technical Mentorship: Coached developers through code reviews and knowledge-sharing sessions on architecture and design patterns"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Software Architect, Senior Developer",
      "dates": "2013 — 2019",
      "description": "Solution architect for enterprise client engagements. Led backend architecture design, API contracts, and data modeling for complex multi-tier systems.",
      "bullets": [
        "CAE PreStudy: Designed backend architecture with Spring Boot, RESTful APIs, and data persistence layer for aviation pilot training",
        "Acosta SLTouch: Architected Node.js backend services and data aggregation pipelines for retail analytics platform",
        "Skillable: Delivered backend services for Progressive Web App micro-learning platform using TypeScript and Node.js",
        "Solution Architecture: Translated business requirements into API contracts, data models, and integration strategies"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "Back-End Java Developer → iOS Developer",
      "dates": "2009 — 2013",
      "description": "Backend engineer for urban mobility systems (Bixi). Built event-driven Java services processing real-time data from bike-sharing kiosks deployed across major cities.",
      "bullets": [
        "Event-Driven Services: Built Java services for Solstice using event-driven architecture — real-time transaction processing, station state management, and availability APIs",
        "Data Pipelines: Designed high-throughput pipelines processing telemetry from solar-powered POS kiosks (London, NYC) — event sourcing for station state tracking and availability",
        "Full-Stack Transition: Transitioned to iOS development, bringing backend expertise that bridged system layers and improved API design"
      ]
    },
    {
      "company": "Accovia",
      "title": "Back-End Java Developer — Architecture Team",
      "dates": "2007 — 2009",
      "bullets": [
        "Platform Rebuild: Rebuilt Ibiza travel platform with Java/Spring/Hibernate after critical client recovery — service architecture, data access patterns"
      ]
    },
    {
      "company": "Compuware Montreal",
      "title": "Java Consultant (Morgan Stanley)",
      "dates": "2005 — 2007",
      "bullets": [
        "Mainframe Migration: Libra project — migrated COBOL batch processing and data pipelines to Java/DB2 with event-driven integration patterns; financial compliance, globally distributed team"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Java Developer — Infrastructure Team",
      "dates": "2003 — 2005",
      "bullets": [
        "Core Services: Built core backend services and shared infrastructure patterns adopted by multiple e-commerce product teams"
      ]
    }
  ]
}