{
  "name": "Claude Houle",
  "title": "Développeur Java sénior & Ingénieur backend",
  "email": "claude.houle@gmail.com",
  "web": "choule99.github.io/me",
  "location": "Montréal, QC",
  "phone": "450.723.3075",
  "sections": {
    "profile": "Profil",
    "accomplishments": "Réalisations clés",
    "skills": "Compétences techniques",
    "experience": "Expérience professionnelle",
    "education": "Formation Académique"
  },
  "education": {
    "degree": "Technique de l'informatique",
    "school": "Collège Édouard-Montpetit, Longueuil",
    "dates": "2003",
    "description": "Diplôme d'études collégiales (DEC) de trois ans couvrant le C, C++, JavaScript, SQL, Linux et l'informatique appliquée.",
    "capstone": "Projet de fin d'études : Réalisation technique d'un site Internet (e-commerce) pour une entreprise."
  },
  "summary": "Ingénieur backend sénior avec une expérience approfondie dans la construction de systèmes Java d'entreprise, d'architectures microservices et de plateformes de données à haut débit. Accent marqué sur la fiabilité, la stabilité, les tests et une architecture pragmatique à travers l'écosystème Spring et les systèmes distribués.",
  "accomplishments": [
    "Conçu et livré la reconstruction de la plateforme de voyage Ibiza chez Accovia — backend Java/Spring/Hibernate servant les principaux opérateurs de voyage, livré à temps après un redressement client critique",
    "Construit les services backend de la plateforme Solstice de 8D Technologies — système Java traitant les événements en temps réel des kiosques de vélo-partage Bixi déployés dans des villes à travers le monde",
    "Conçu l'architecture backend de la plateforme de formation des pilotes de CAE chez Spiria — APIs Spring Boot, modélisation de données et stratégies d'intégration supportant les exigences de conformité aéronautique",
    "Construit les services d'infrastructure de base chez Mediagrif adoptés par plusieurs équipes de produits e-commerce — couches d'accès aux données réutilisables, composants de service et patterns d'API"
  ],
  "skills": [
    {
      "section": "Expertise Backend"
    },
    {
      "label": "Langages",
      "items": [
        "Java (expert)",
        "Kotlin",
        "SQL",
        "TypeScript",
        "Python"
      ]
    },
    {
      "label": "Frameworks",
      "items": [
        "Spring Boot",
        "Spring Security",
        "Hibernate/JPA",
        "REST APIs",
        "Microservices"
      ]
    },
    {
      "label": "Données",
      "items": [
        "PostgreSQL",
        "MySQL",
        "Oracle",
        "DB2",
        "Redis",
        "ActiveMQ"
      ]
    },
    {
      "section": "Architecture & DevOps"
    },
    {
      "label": "Architecture",
      "items": [
        "Domain-Driven Design",
        "CQRS",
        "Event Sourcing",
        "API Design",
        "System Integration"
      ]
    },
    {
      "label": "CI/CD",
      "items": [
        "Docker",
        "Kubernetes",
        "Jenkins",
        "GitLab CI",
        "GitHub Actions"
      ]
    },
    {
      "label": "Tests",
      "items": [
        "JUnit",
        "Mockito",
        "Integration Testing",
        "TDD",
        "Contract Testing"
      ]
    },
    {
      "label": "IA Générative",
      "items": [
        "Claude (accélération code & tests)"
      ]
    },
    {
      "section": "Leadership & Méthodologies"
    },
    {
      "label": "Leadership",
      "items": [
        "Mentorat",
        "Code Reviews",
        "Documentation technique",
        "Onboarding"
      ]
    },
    {
      "label": "Méthodes",
      "items": [
        "Agile (Scrum/Kanban)",
        "TDD",
        "Intégration continue"
      ]
    },
    {
      "label": "Langues",
      "items": [
        "Français et Anglais (parfaitement bilingue)"
      ]
    }
  ],
  "experience": [
    {
      "company": "Poka Inc.",
      "title": "Lead développeur",
      "dates": "2021 — Présent",
      "description": "Développeur sénior d'une plateforme pour travailleurs connectés servant plus de 200 000 utilisateurs actifs quotidiens. Conception des contrats d'API REST et stratégies de synchronisation reliant les équipes frontend et backend.",
      "bullets": [
        "Architecture API : Conception des contrats d'API REST assurant l'interopérabilité entre clients mobiles et microservices backend — adoptés comme standard par les équipes frontend et backend",
        "Standards inter-équipes : Établissement de standards d'ingénierie partagés, pratiques de revue de code et conventions d'API à travers les équipes frontend et backend",
        "Synchronisation de données : Architecture des stratégies de synchronisation pour clients mobiles offline-first — cohérence et fiabilité à travers services distribués",
        "Mentorat technique : Mentorat technique et formation sur les patterns d'architecture et meilleures pratiques pour 20 développeurs — opérationnels en 3 mois"
      ]
    },
    {
      "company": "Appcom",
      "title": "Lead développeur mobile",
      "dates": "2019 — 2021",
      "description": "Direction de l'architecture technique et de l'intégration API sur plus de 15 projets clients dans les secteurs de la santé, des médias et du commerce de détail.",
      "bullets": [
        "Bibliothèques de composants : Conception de bibliothèques partagées et patterns architecturaux adoptés par plusieurs équipes de projet",
        "Intégration API : Direction des efforts d'intégration avec divers systèmes backend — patterns de gestion d'erreurs, mise en cache et support hors ligne",
        "Mentorat technique : Accompagnement des développeurs via revues de code et sessions de partage de connaissances sur l'architecture"
      ]
    },
    {
      "company": "Spiria Digital",
      "title": "Développeur logiciel sénior",
      "dates": "2013 — 2019",
      "description": "Développeur sénior pour engagements clients d'entreprise. Direction de l'architecture backend, contrats d'API et modélisation de données pour systèmes multi-tiers complexes.",
      "bullets": [
        "CAE PreStudy : Architecture backend avec Spring Boot, APIs RESTful et couche de persistance pour plateforme de formation des pilotes d'aviation",
        "Acosta SLTouch : Architecture des services backend Node.js et pipelines d'agrégation de données pour plateforme d'analytique de détail",
        "Skillable : Livraison des services backend pour plateforme de micro-apprentissage Progressive Web App avec TypeScript et Node.js",
        "Architecture de solutions : Traduction des exigences d'affaires en contrats d'API, modèles de données et stratégies d'intégration"
      ]
    },
    {
      "company": "8D Technologies",
      "title": "Développeur Java back-end → Développeur iOS",
      "dates": "2009 — 2013",
      "description": "Ingénieur backend pour systèmes de mobilité urbaine (Bixi). Construction de services Java événementiels traitant les données en temps réel des kiosques de vélo-partage déployés dans les grandes villes.",
      "bullets": [
        "Services événementiels : Construction des services Java pour Solstice avec architecture événementielle — traitement transactionnel en temps réel, gestion d'état des stations et APIs de disponibilité",
        "Pipelines de données : Conception de pipelines à haut débit traitant la télémétrie des kiosques solaires (Londres, New York) — event sourcing pour le suivi d'état et de disponibilité des stations",
        "Transition full-stack : Passage au développement iOS, apportant l'expertise backend pour améliorer la conception des API"
      ]
    },
    {
      "company": "Accovia",
      "title": "Développeur Java back-end — Équipe d'architecture",
      "dates": "2007 — 2009",
      "bullets": [
        "Reconstruction de plateforme : Reconstruction de la plateforme de voyage Ibiza avec Java/Spring/Hibernate après redressement client — architecture de services, patterns d'accès aux données"
      ]
    },
    {
      "company": "Compuware Montréal",
      "title": "Consultant Java (Morgan Stanley)",
      "dates": "2005 — 2007",
      "bullets": [
        "Migration mainframe : Projet Libra — migration du traitement batch COBOL et pipelines de données vers Java/DB2 avec patterns d'intégration événementiels ; conformité financière, équipe distribuée mondialement"
      ]
    },
    {
      "company": "Mediagrif",
      "title": "Développeur Java",
      "dates": "2003 — 2005",
      "bullets": [
        "Services de base : Construction des services backend et patterns d'infrastructure partagés adoptés par plusieurs équipes e-commerce"
      ]
    }
  ]
}